---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldScaleX
source: html/288b0c3f-34fa-463e-5432-bb4f092d9ed9.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldScaleX Property

The property labeled "Size X" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".